In [2]:
# 설정변경코드
# 변수 명이 두번 이상 출력되어도 모두 콘솔에서 보여줄 것

from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity="all"

In [3]:
# 모듈 import
import numpy as np
import pandas as pd

### pandas 데이터처리 및 변환관련 함수

#### 데이터 개수 세기
- 가장 간단한 분석은 개수 세기이다. count()함수 이용
    -Nan 값은 세지 않는다

In [4]:
# 시리즈에서 개수 세기
s = pd.Series(range(10))
s[3] = np.nan
s

0    0.0
1    1.0
2    2.0
3    NaN
4    4.0
5    5.0
6    6.0
7    7.0
8    8.0
9    9.0
dtype: float64

In [5]:
s.count() # Nan값은 제외 9를 반환

9

### 데이터 프레임에 count()함수 적용하기
- 각 열마다 데이터 개수를 세기 때문에 누락된 부분을 찾을 때 유용

### 난수 발생시켜 DataFrame 생성
- 난수 seed(값)라는 함수를 사용
- seed의 의미 : 난수 알고리즘에서 사용하는 기본 값으로
    - 시드값이 같으면 동일한 난수가 발생
- 계속 변경되는 난수를 받고 싶다면 함수 등을 이용해서 시드값이 매번 변하게 작업. Time.time()

In [6]:
# np.random.seed(1) # 고정 시드값
import time
np.random.seed(int(time.time())) # 변경 시드값
np.random.randint(5,size=4)

array([1, 0, 3, 2])

In [7]:
# np.random.seed(1) # 고정 시드값
import time
np.random.seed(int(time.time())) # 변경 시드값
np.random.randint(45,size=6)

array([33, 13, 40, 11, 23, 38])

In [8]:
np.random.seed(1)
df1 = pd.DataFrame(np.random.randint(5,size=(4,4)))
df1.iloc[2,3] = np.nan
df1

   0  1  2    3
0  3  4  0  1.0
1  3  0  0  1.0
2  4  4  1  NaN
3  4  2  4  3.0

In [9]:
df1.count() # df1의 각 열의 데이터의 객수를 센 결과를 반환
# 시리즈 형태로 반환

0    4
1    4
2    4
3    3
dtype: int64

In [10]:
# 타이타닉호 승객 데이터를 사용
# seaborn 패키지 내에 data로 존재
import seaborn as sns # seaborn 패키지 - 그래프 그리는 패키지
# titanic 데이터 셋 로드 : load_dataset('data명')
titanic = sns.load_dataset('titanic')
# 데이터셋의 앞부분을 추출해서 반환하는 함수 dataset.head() : 매개변수 생략 5개 반환
titanic.head(10)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
5,0,3,male,NaN,0,0,8.4583,Q,Third,man,True,NaN,Queenstown,no,True
6,0,1,male,54.0,0,0,51.8625,S,First,man,True,E,Southampton,no,True
7,0,3,male,2.0,3,1,21.0750,S,Third,child,False,NaN,Southampton,no,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False

In [11]:
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

- 카테고리 값 세기
    - 시리즈의 값이 정수, 문자열 등 카테고리 값인 경우에
    - value_count()메서드를 이용해 각각의 값이 나온 횟수를 셀 수 있음

In [12]:
np.random.seed(1)
s2 = pd.Series(np.random.randint(6,size=100))
s2.tail() # 데이터의 뒷부분의 값 5개 출력
len(s2)

95    4
96    5
97    2
98    4
99    3
dtype: int32

100

In [13]:
s2.value_counts()

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [14]:
df1

   0  1  2    3
0  3  4  0  1.0
1  3  0  0  1.0
2  4  4  1  NaN
3  4  2  4  3.0

- 데이터프레임에서는 value_counts() 함수 사용불가
- 시리즈에서는 사용가능
- 데이트프레임에서 사용할 때는 각 열마다 별도로 정의한다.

In [15]:
# 데이터 프레임이 value_counts() 적용 
df1.value_counts() # Error???
df1[0].value_counts()
df1.iloc[2,3] = np.nan # nan값도 계수 하는지
df1[3].value_counts() # nan은 계수 하지 않는다

0  1  2  3
4  2  4  3.0    1
3  4  0  1.0    1
   0  0  1.0    1
dtype: int64

3    2
4    2
Name: 0, dtype: int64

1.0    2
3.0    1
Name: 3, dtype: int64

In [16]:
# tatanic dataset을 참고하여 생존자와 사망자의 수를 파악하시오.
titanic.head()
titanic['alive'].value_counts()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

no     549
yes    342
Name: alive, dtype: int64

In [17]:
- sort_index() : 인덱스를 기준으로 정렬
- sort_values() : value를 기준으로 정렬

SyntaxError: invalid syntax (<ipython-input-17-6af216c226dd>, line 1)

In [18]:
s2

0     5
1     3
2     4
3     0
4     1
     ..
95    4
96    5
97    2
98    4
99    3
Length: 100, dtype: int32

In [19]:
# 시리즈 구조 정렬
s2.value_counts().sort_index() # 시리즈 데이터의 index를 기준으로 정렬

0    18
1    22
2    13
3    14
4    17
5    16
dtype: int64

In [20]:
s2.value_counts().sort_values() # 값을 기준으로 오름차순 정렬
s2.value_counts().sort_values(ascending=False) # 값을 기준으로 내림차순 정렬

2    13
3    14
5    16
4    17
0    18
1    22
dtype: int64

1    22
0    18
4    17
5    16
3    14
2    13
dtype: int64

In [21]:
s2.sort_values()

57    0
38    0
39    0
85    0
28    0
     ..
71    5
40    5
46    5
11    5
0     5
Length: 100, dtype: int32

### 데이터 프레임 정렬
- 데이터프레임은 2차원 배열과 동일하기 때문에
    - 정렬시 기준열ㅇ르 줘야한다. by인수 사용
- by = 기준열, by = [기준열1,기준열2] - 기준열1을 이용해서 정렬하고 같은 값에 대해서는 기준열 2로 정렬

In [22]:
df1

   0  1  2    3
0  3  4  0  1.0
1  3  0  0  1.0
2  4  4  1  NaN
3  4  2  4  3.0

In [23]:
df1.sort_values(by=0) # 기준열을 0열로 정함
df1.sort_values(by=[0,1]) # 기준열을 0,1열로 정함

   0  1  2    3
0  3  4  0  1.0
1  3  0  0  1.0
2  4  4  1  NaN
3  4  2  4  3.0

   0  1  2    3
1  3  0  0  1.0
0  3  4  0  1.0
3  4  2  4  3.0
2  4  4  1  NaN

### 연습문제
- 타이타닉 호 승객에 대해서, 성별(sex) 인원수, 나이별(age) 인원수, 선실별(class)인원수, 사망/생존(alive)인원수를 구하시오
- 성별 인원수는 인덱스 기준으로 정렬하고 나이별 인원수는 값 기준 정렬
- 그 나머지는 임의 기준 정렬하시오.

In [24]:
titanic = sns.load_dataset('titanic')
titanic['sex'].value_counts().sort_index()
titanic['age'].value_counts().sort_values()

female    314
male      577
Name: sex, dtype: int64

0.42      1
20.50     1
24.50     1
0.67      1
14.50     1
         ..
30.00    25
19.00    25
18.00    26
22.00    27
24.00    30
Name: age, Length: 88, dtype: int64

In [25]:
# 선실별(calss)인원수
# 인덱스명이 예약어와 동일한 경우에는 .인덱스명 접근은 불가능 df1['class']로 접근
# type(df1,iloc[0,0])
# titanic.class.value_counts()
titanic['class'].value_counts()

Third     491
First     216
Second    184
Name: class, dtype: int64

In [26]:
titanic['alive'].value_counts().sort_values(ascending=False)

no     549
yes    342
Name: alive, dtype: int64

### 행/열 합계
- 행과 열의 합계를 구할 때는 sum(axis=0/1) - axis는 0이 기본

In [27]:
# 4행 8열의 데이터 프레임 생성, data난수를 발생시켜서 사용
# 매번 같은 난수가 발생되면서 0-9범위에서 발생하도록 설정
np.random.seed(3)
df2 = pd.DataFrame(np.random.randint(10,size=(4,8)))
df2

   0  1  2  3  4  5  6  7
0  8  9  3  8  8  0  5  3
1  9  9  5  7  6  0  4  7
2  8  1  6  2  2  1  3  5
3  8  1  8  7  8  1  0  5

In [28]:
# 각 행의 합계 - df.sum(axis=1)
df2.sum(axis=1) # Series

0    44
1    47
2    28
3    38
dtype: int64

In [29]:
# 각 열의 합계 - df.sum(axis=1)
df2.sum(axis=0)
df2.sum() # axis 기본값은 0 - 열방향

0    33
1    20
2    22
3    24
4    24
5     2
6    12
7    20
dtype: int64

0    33
1    20
2    22
3    24
4    24
5     2
6    12
7    20
dtype: int64

In [30]:
# 각 행의 합계를 구해서 새로운 열 rowsum으로 추가
df2['RowSum'] = df2.sum(axis=1)
df2

   0  1  2  3  4  5  6  7  RowSum
0  8  9  3  8  8  0  5  3      44
1  9  9  5  7  6  0  4  7      47
2  8  1  6  2  2  1  3  5      28
3  8  1  8  7  8  1  0  5      38

In [31]:
# 새로운 행 추가
# loc인덱서 사용 가장 간단하게 추가
# ColTotal
df2.loc['ColTotal'] = df2.sum()

In [32]:
df2

           0   1   2   3   4  5   6   7  RowSum
0          8   9   3   8   8  0   5   3      44
1          9   9   5   7   6  0   4   7      47
2          8   1   6   2   2  1   3   5      28
3          8   1   8   7   8  1   0   5      38
ColTotal  33  20  22  24  24  2  12  20     157

In [33]:
# 행/열 삭제
# df.drop('행이름', 0) - 행을 제거한 df을 반환(원본에 반영 안됨)
# df.drop('열이름', 1) - 열을 제거한 df를 반환(원본에 반영 안됨)
# 원본을 수정하려면 저장
df2.drop('ColTotal',0)
df2.drop('RowSum',1)

   0  1  2  3  4  5  6  7  RowSum
0  8  9  3  8  8  0  5  3      44
1  9  9  5  7  6  0  4  7      47
2  8  1  6  2  2  1  3  5      28
3  8  1  8  7  8  1  0  5      38

           0   1   2   3   4  5   6   7
0          8   9   3   8   8  0   5   3
1          9   9   5   7   6  0   4   7
2          8   1   6   2   2  1   3   5
3          8   1   8   7   8  1   0   5
ColTotal  33  20  22  24  24  2  12  20

In [34]:
df2.mean(axis=0)
df2.max(axis=0)
df2.min(axis=0)

0         13.2
1          8.0
2          8.8
3          9.6
4          9.6
5          0.8
6          4.8
7          8.0
RowSum    62.8
dtype: float64

0          33
1          20
2          22
3          24
4          24
5           2
6          12
7          20
RowSum    157
dtype: int64

0          8
1          1
2          3
3          2
4          2
5          0
6          0
7          3
RowSum    28
dtype: int64

In [35]:
# 예제 df 생성 
df3 = pd.DataFrame({
    'a':[1,3,4,3,4],
    'b':[2,3,1,4,5],
    'c':[1,5,2,4,4],
})
df3

   a  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  4  4
4  4  5  4

In [36]:
# max, min 함수 활용 예제
# df3데이터 프레임 각 열, 각 행의 최대값과 최소값의 차이를 구하시오
# 함수정의 - 1회성 함수 (lanbda 매개변수 : 함수내에서 일어나야할 연산)
# 함수를 각 열마다 호출 결과 반환 받아서 리스트에 저장

# 동일한 연산을 모든열에 혹은 모든 행에 반복 적용하고자 할때 - df.apply(반복적용할 함수)
df3
df3.apply(lambda x: x.max()-x.min(),axis=0)
df3.apply(lambda x: x.max()-x.min(),axis=1)

   a  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  4  4
4  4  5  4

a    3
b    4
c    4
dtype: int64

0    1
1    2
2    3
3    1
4    1
dtype: int64

### 데이터값을 카테고리 값으로 변환
- 값의 크기를 기준으로 하여 카테고리 값으로 변환하고 싶을 때
- cut(data,bins,label)
- data : 구간 나눌 실제 값, bis : 구간 경계값, label : 카테고리값
- qcut(data,bins,label)

In [37]:
# 구간을 나눌 실제 값 : 관측 데이터
ages = [0,0,4,0,4,4,2,10,21,23,37,15,38,31,81,20,341,31,100]

In [38]:
# 구간 경계값 설정
bins = [0,15,25,35,60,100]
# label : 카테고리명
labels = ['미성년자','청년','중년','장년','노년']

In [39]:
# 함수 적용해서 카테고리 생성
cats = pd.cut(ages,bins,labels=labels)
cats

[NaN, NaN, '미성년자', NaN, '미성년자', ..., '노년', '청년', NaN, '중년', '노년']
Length: 19
Categories (5, object): ['미성년자' < '청년' < '중년' < '장년' < '노년']

In [40]:
type(cats)

pandas.core.arrays.categorical.Categorical

In [41]:
cats.categories # 카테고리 값을 출력

Index(['미성년자', '청년', '중년', '장년', '노년'], dtype='object')

In [42]:
cats.codes # -1로 나오는건 카테고리를 정하지 못했음을 의미

array([-1, -1,  0, -1,  0,  0,  0,  0,  1,  1,  3,  0,  3,  2,  4,  1, -1,
        2,  4], dtype=int8)

In [43]:
# age 리스트를 이용해서 df 생성
df4 = pd.DataFrame(ages, columns = ['ages'])
df4

    ages
0      0
1      0
2      4
3      0
4      4
5      4
6      2
7     10
8     21
9     23
10    37
11    15
12    38
13    31
14    81
15    20
16   341
17    31
18   100

In [44]:
df4['age_cut'] = pd.cut(df4.ages,bins,labels=labels)
df4

    ages age_cut
0      0     NaN
1      0     NaN
2      4    미성년자
3      0     NaN
4      4    미성년자
5      4    미성년자
6      2    미성년자
7     10    미성년자
8     21      청년
9     23      청년
10    37      장년
11    15    미성년자
12    38      장년
13    31      중년
14    81      노년
15    20      청년
16   341     NaN
17    31      중년
18   100      노년

In [45]:
# qcut() : 구간 경계선을 지정하지 않고 데이터 개수가 같도록
#  지정한 수의 구간을 나눈다.
# 예 ) 1000개의 데이터를 4구간으로 나누려고 한다면
# qcut 명령어를 사용 한 구간마다 250개로 나누게 된다.
# 예외 ) 같은 숫자인 경우에는 같은 구간으로 처리한다.
# 형식 : pd.qcut(data, 구간수, labels=[d1,d2...])

In [46]:
# 랜덤 정수 20개를 생성하고 생성된 정수를 4개의 구간으로 나누시오.
# 각 구간의 label은 Q1,Q2,Q3,Q4로 설정하시오.

# 랜덤 정수 생성 : 범위 0-19, size = 20 
# seed 설정해서 재 실행해도 랜덤정수가 변하지 않도록 생성
# seed 설정
np.random.seed(2)
# 랜덤정수 생성
data = np.random.randint(20,size=20)
data

array([ 8, 15, 13,  8, 11, 18, 11,  8,  7,  2, 17, 11, 15,  5,  7,  3,  6,
        4, 10, 11])

In [47]:
qcat = pd.qcut(data,4,labels=['Q1','Q2','Q3','Q4'])
qcat

['Q2', 'Q4', 'Q4', 'Q2', 'Q3', ..., 'Q1', 'Q1', 'Q1', 'Q3', 'Q3']
Length: 20
Categories (4, object): ['Q1' < 'Q2' < 'Q3' < 'Q4']

In [48]:
pd.value_counts(qcat)

Q4    5
Q3    5
Q2    5
Q1    5
dtype: int64

In [49]:
# 연습문제
# 타이타닉호 승객을 사망자와 생존자 그룹으로 나누고(alive)
# 각 그룹에 대해 미성년자, 청년, 중년, 장년, 노년 승객의
# 비율을 구하시오.
# bins=[1,15,25,35,60,99]
# labels=['미성년자','청년','중년','장년','노년']
# 각 그룹별 비율의 전체 합은 1이 되어야 한다.
# 비율구하는 함수 사용하지 말고 집접 계산해볼것 ('cut'함수)

In [50]:
# 타이타닉 승객 dataset 읽어오기
import seaborn as sns
titanic = sns.load_dataset('titanic')
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [51]:
# 타이타닉호 승객을 사망자와 생존자 그룹으로 나누고(alive)
# 사망자 그룹 추출 후 새로운 df 생성
no = titanic[titanic.alive == 'no']
no.count()

survived       549
pclass         549
sex            549
age            424
sibsp          549
parch          549
fare           549
embarked       549
class          549
who            549
adult_male     549
deck            67
embark_town    549
alive          549
alone          549
dtype: int64

In [52]:
yes = titanic[titanic.alive == 'yes']
yes.count()

survived       342
pclass         342
sex            342
age            290
sibsp          342
parch          342
fare           342
embarked       340
class          342
who            342
adult_male     342
deck           136
embark_town    340
alive          342
alone          342
dtype: int64

In [53]:
# 라벨설정
labels = ['미성년자', '청년', ' 중년', ' 장년', '노년']

In [57]:
# 범위
# bis = [1,14,25,35,60,99]
np.min(no.age)
np.max(no.age)
np.min(yes.age)
np.max(yes.age)
# 사망자 최소값은 1.0, 생존자 최소값은 0.42bis의 처읍 값 수정필요
# 최값은 84와 80 이므로 bis의 끝값 수정 필요 없음
bins = [0,14,25,35,60,99]

1.0

74.0

0.42

80.0

In [61]:
# 카테고리 데이터 생성
no['age_cut'] = pd.cut(no['age'],bins,labels=labels) # 사망자
yes['age_cut'] = pd.cut(yes['age'],bins,labels=labels)

<ipython-input-61-7fefeab2d8f7>:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  no['age_cut'] = pd.cut(no['age'],bins,labels=labels) # 사망자
<ipython-input-61-7fefeab2d8f7>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  yes['age_cut'] = pd.cut(yes['age'],bins,labels=labels)

In [ ]:
no.head()
yes.head()

In [63]:
# 카테고리 데이터들의 빈도 수 계산
# 사망자 그룹 계산
no['age_cut'].value_counts() # 사망자 데이터의 연령대별 승객 수 계산
no['age_cut'].count() # 전체 사망 승객수 
# 각 연령대 별 승객 수 비율 계산
no['age_cut'].value_counts() / no['age_cut'].count() 
# 전체 비율의 합 계산
(no['age_cut'].value_counts() / no['age_cut'].count()).sum()

청년      145
 장년     117
 중년     113
미성년자     32
노년       17
Name: age_cut, dtype: int64

424

청년      0.341981
 장년     0.275943
 중년     0.266509
미성년자    0.075472
노년      0.040094
Name: age_cut, dtype: float64

1.0

In [64]:
# 생존자 그룹 계산
yes['age_cut'].value_counts() # 생존자 데이터의 연령대별 승객 수 계산
yes['age_cut'].count() # 전체 생존자 승객수 
# 각 연령대 별 승객 수 비율 계산
yes['age_cut'].value_counts() / yes['age_cut'].count() 
# 전체 비율의 합 계산
(yes['age_cut'].value_counts() / yes['age_cut'].count()).sum()

 중년     83
청년      79
 장년     78
미성년자    45
노년       5
Name: age_cut, dtype: int64

290

 중년     0.286207
청년      0.272414
 장년     0.268966
미성년자    0.155172
노년      0.017241
Name: age_cut, dtype: float64

1.0

### 추가설명

In [84]:
# 데이터 프레임에 value_counts( ) 적용 : pd 버전 1.1 이상이면 가능하다
pd.__version__

'1.1.3'

In [65]:
df1 = pd.DataFrame(np.random.randint(5,size=(4,4))) # 기본정수
#df
df1.iloc[2,3] = np.nan
df1
df1.value_counts()
# 행이 몇번 반복되는지 빈도수를 반환

   0  1  2    3
0  3  2  1  2.0
1  4  3  0  4.0
2  3  1  2  NaN
3  4  4  2  4.0

0  1  2  3
4  4  2  4.0    1
   3  0  4.0    1
3  2  1  2.0    1
dtype: int64

### 인덱스 설정함수(추가) - 코딩노트에 기재
#### 데이터 프레임 인덱스 설정을 위해 set_index(),reset_index()
- set_index() : 기존의 행 인덱스를 제거하고 데이터 열 중 하나를 인덱스로 설정해주는 함수
- reset_index() : 기존 행 인ㄷ게스를 제거하고 기본 인덱스를 변경
- 기본 인덱스 : 0부터 1씩 증가하는 정수 인덱스
    - 따로 설정하지 안흥면 기존 인덱스는 데이터열로 추가 됨

In [66]:
#예제 데이터프레임 생성
df3 = pd.DataFrame({
    'a':[1,3,4,3,4],
    'b':[2,3,1,4,5],
    'c':[1,5,2,4,4]
})
df3

   a  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  4  4
4  4  5  4

In [68]:
# df3은 index 설정이 없어서 기본 인덱스로 생성되어 있음
# df3의 a열을 인덱스로 설정하시오.
df3.set_index('a') # 인덱스 설정 후 반환 - 원본에 반영하지 않는다. (필요하면 저장해야 함)
df3
df3 = df3.set_index('a')
df3

   b  c
a
1  2  1
3  3  5
4  1  2
3  4  4
4  5  4

   a  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  4  4
4  4  5  4

   b  c
a
1  2  1
3  3  5
4  1  2
3  4  4
4  5  4

In [71]:
# df3의 행 인덱스를제거하고 기본 인덱스로 설정하시오.
df3
df3.reset_index() # 설정이 없으면 원래 index가 데이터로 처리
df3.reset_index(drop=True) # 원래 index가 제거 (drop=True)
df3 ## 원본반영 안됨

   b  c
a
1  2  1
3  3  5
4  1  2
3  4  4
4  5  4

   a  b  c
0  1  2  1
1  3  3  5
2  4  1  2
3  3  4  4
4  4  5  4

   b  c
0  2  1
1  3  5
2  1  2
3  4  4
4  5  4

   b  c
a
1  2  1
3  3  5
4  1  2
3  4  4
4  5  4

In [72]:
# index 이름 바꾸기(행 인덱스)
# df3  데이터 프레임의 행 인덱스를 제거하고 기본 인덱스로 설정하시오. df3에 반영하시오
# 단, 원인덱스는 삭제한다.
df3 = df3.reset_index(drop = True)

In [73]:
df3

   b  c
0  2  1
1  3  5
2  1  2
3  4  4
4  5  4

In [74]:
# index 이름 바꾸기(행 인덱스)
# rename()
# df.rename(index = {현재인덱스:바꿀인덱스})
df3.rename(index={0:'1반'}) # 원본 방영 되지 않음
df3

    b  c
1반  2  1
1   3  5
2   1  2
3   4  4
4   5  4

   b  c
0  2  1
1  3  5
2  1  2
3  4  4
4  5  4

In [75]:
df3.rename(columns={'b':'학생'}) # 열 인덱스 명 변경 - 원본 반영되지 않음

   학생  c
0   2  1
1   3  5
2   1  2
3   4  4
4   5  4

In [78]:
a = [1,2,3,4]
# 위 a 리스트의 각 원소에 2배한 원소값을 만들고 리스트로
# 저장하시오. 반복문을 사용할 것
# result = [2,4,6,8]
result=[]
for num in a :
    result.append(num*2)
result

[2, 4, 6, 8]

In [80]:
# 리스트 내포 for 문
result = [num*2 for num in a]
result

[2, 4, 6, 8]

리스트 내포 for 문의 일반 무법
- [표현식(연산식) for 항목 in 반복가능객체 if조건문]
- if 조건문은 생략 가능하다.
- 반본가능객체 : 리스트, 튜플, 딕셔너리, range() 등`

In [82]:
# 연습문제
# ['id_1','id_2','id_3','id_4'] 와 같은 리스트 요소를 
# 내포 for문을 이용해서 생성 후 리스트로 추가하시오.
['id_'+str(i) for i in range(1,5)]
['id_'+str(i) for i in range(1,5)]*2

['id_1', 'id_2', 'id_3', 'id_4']

['id_1', 'id_2', 'id_3', 'id_4', 'id_1', 'id_2', 'id_3', 'id_4']